bharrisau/s08-245/include/mc9s08js16l.h
#define SPIS_MODF_MASK                  16U
#define SPIS_SPTEF_MASK                 32U
#define SPIS_SPMF_MASK                  64U
#define SPIS_SPRF_MASK                  128U


/*** SPID16 - SPI Data Register; 0x00000034 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** SPIDH - SPI Data Register High; 0x00000034 ***/
    union {
      byte Byte;
    } SPIDHSTR;
    #define SPIDH                       _SPID16.Overlap_STR.SPIDHSTR.Byte
    

    /*** SPIDL - SPI Data Register Low; 0x00000035 ***/
    union {
      byte Byte;
      union { /* Several registers at the same address */
        /*** SPIDL - SPI Data Register Low; Several registers at the same address ***/
        #define SPIDL                   _SPID16.Overlap_STR.SPIDLSTR.Byte
        
        /*** SPID - SPI Data Register Low; Several registers at the same address ***/
        union {
          struct {
            byte Bit0        :1;                                       /* SPI Data Bit 0 */
            byte Bit1        :1;                                       /* SPI Data Bit 1 */
            byte Bit2        :1;                                       /* SPI Data Bit 2 */
            byte Bit3        :1;                                       /* SPI Data Bit 3 */
            byte Bit4        :1;                                       /* SPI Data Bit 4 */
            byte Bit5        :1;                                       /* SPI Data Bit 5 */
            byte Bit6        :1;                                       /* SPI Data Bit 6 */
            byte Bit7        :1;                                       /* SPI Data Bit 7 */
          } Bits;
        } SPIDSTR;
        #define SPID                    _SPID16.Overlap_STR.SPIDLSTR.Byte
        #define SPID_Bit0               _SPID16.Overlap_STR.SPIDLSTR.SameAddr_STR.SPIDSTR.Bits.Bit0
        #define SPID_Bit1               _SPID16.Overlap_STR.SPIDLSTR.SameAddr_STR.SPIDSTR.Bits.Bit1
        #define SPID_Bit2               _SPID16.Overlap_STR.SPIDLSTR.SameAddr_STR.SPIDSTR.Bits.Bit2
        #define SPID_Bit3               _SPID16.Overlap_STR.SPIDLSTR.SameAddr_STR.SPIDSTR.Bits.Bit3
        #define SPID_Bit4               _SPID16.Overlap_STR.SPIDLSTR.SameAddr_STR.SPIDSTR.Bits.Bit4
        #define SPID_Bit5               _SPID16.Overlap_STR.SPIDLSTR.SameAddr_STR.SPIDSTR.Bits.Bit5
        #define SPID_Bit6               _SPID16.Overlap_STR.SPIDLSTR.SameAddr_STR.SPIDSTR.Bits.Bit6
        #define SPID_Bit7               _SPID16.Overlap_STR.SPIDLSTR.SameAddr_STR.SPIDSTR.Bits.Bit7
        
        #define SPID_Bit0_MASK          1U
        #define SPID_Bit1_MASK          2U
        #define SPID_Bit2_MASK          4U
        #define SPID_Bit3_MASK          8U
        #define SPID_Bit4_MASK          16U
        #define SPID_Bit5_MASK          32U
        #define SPID_Bit6_MASK          64U
        #define SPID_Bit7_MASK          128U
        
      } SameAddr_STR; /*Several registers at the same address */
    
    } SPIDLSTR;
    
  } Overlap_STR;

} SPID16STR;
extern volatile SPID16STR _SPID16 @0x00000034;
#define SPID16                          _SPID16.Word


/*** SPIM - SPI Match Register; 0x00000036 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** SPIMH - SPI Match Register High; 0x00000036 ***/
    union {
      byte Byte;
      struct {
        byte Bit8        :1;                                       /* SPI Match Value Bit 8 */
        byte Bit9        :1;                                       /* SPI Match Value Bit 9 */
        byte Bit10       :1;                                       /* SPI Match Value Bit 10 */
        byte Bit11       :1;                                       /* SPI Match Value Bit 11 */
        byte Bit12       :1;                                       /* SPI Match Value Bit 12 */
        byte Bit13       :1;                                       /* SPI Match Value Bit 13 */
        byte Bit14       :1;                                       /* SPI Match Value Bit 14 */
        byte Bit15       :1;                                       /* SPI Match Value Bit 15 */
      } Bits;
    } SPIMHSTR;
    #define SPIMH                       _SPIM.Overlap_STR.SPIMHSTR.Byte
    #define SPIMH_Bit8                  _SPIM.Overlap_STR.SPIMHSTR.Bits.Bit8
    #define SPIMH_Bit9                  _SPIM.Overlap_STR.SPIMHSTR.Bits.Bit9
    #define SPIMH_Bit10                 _SPIM.Overlap_STR.SPIMHSTR.Bits.Bit10
    #define SPIMH_Bit11                 _SPIM.Overlap_STR.SPIMHSTR.Bits.Bit11
    #define SPIMH_Bit12                 _SPIM.Overlap_STR.SPIMHSTR.Bits.Bit12
    #define SPIMH_Bit13                 _SPIM.Overlap_STR.SPIMHSTR.Bits.Bit13
    #define SPIMH_Bit14                 _SPIM.Overlap_STR.SPIMHSTR.Bits.Bit14
    #define SPIMH_Bit15                 _SPIM.Overlap_STR.SPIMHSTR.Bits.Bit15
    
    #define SPIMH_Bit8_MASK             1U
    #define SPIMH_Bit9_MASK             2U
    #define SPIMH_Bit10_MASK            4U
    #define SPIMH_Bit11_MASK            8U
    #define SPIMH_Bit12_MASK            16U
    #define SPIMH_Bit13_MASK            32U
    #define SPIMH_Bit14_MASK            64U
    #define SPIMH_Bit15_MASK            128U
    

    /*** SPIML - SPI Match Register Low; 0x00000037 ***/
    union {
      byte Byte;
      struct {
        byte Bit0        :1;                                       /* SPI Match Value Bit 0 */
        byte Bit1        :1;                                       /* SPI Match Value Bit 1 */
        byte Bit2        :1;                                       /* SPI Match Value Bit 2 */
        byte Bit3        :1;                                       /* SPI Match Value Bit 3 */
        byte Bit4        :1;                                       /* SPI Match Value Bit 4 */
        byte Bit5        :1;                                       /* SPI Match Value Bit 5 */
        byte Bit6        :1;                                       /* SPI Match Value Bit 6 */
        byte Bit7        :1;                                       /* SPI Match Value Bit 7 */
      } Bits;
    } SPIMLSTR;
    #define SPIML                       _SPIM.Overlap_STR.SPIMLSTR.Byte
    #define SPIML_Bit0                  _SPIM.Overlap_STR.SPIMLSTR.Bits.Bit0
    #define SPIML_Bit1                  _SPIM.Overlap_STR.SPIMLSTR.Bits.Bit1
    #define SPIML_Bit2                  _SPIM.Overlap_STR.SPIMLSTR.Bits.Bit2
    #define SPIML_Bit3                  _SPIM.Overlap_STR.SPIMLSTR.Bits.Bit3
    #define SPIML_Bit4                  _SPIM.Overlap_STR.SPIMLSTR.Bits.Bit4
    #define SPIML_Bit5                  _SPIM.Overlap_STR.SPIMLSTR.Bits.Bit5
    #define SPIML_Bit6                  _SPIM.Overlap_STR.SPIMLSTR.Bits.Bit6
    #define SPIML_Bit7                  _SPIM.Overlap_STR.SPIMLSTR.Bits.Bit7
    
    #define SPIML_Bit0_MASK             1U
    #define SPIML_Bit1_MASK             2U
    #define SPIML_Bit2_MASK             4U
    #define SPIML_Bit3_MASK             8U
    #define SPIML_Bit4_MASK             16U
    #define SPIML_Bit5_MASK             32U
    #define SPIML_Bit6_MASK             64U
    #define SPIML_Bit7_MASK             128U
    
  } Overlap_STR;

} SPIMSTR;
extern volatile SPIMSTR _SPIM @0x00000036;
#define SPIM                            _SPIM.Word


/*** MCGC1 - MCG Control Register 1; 0x00000040 ***/
typedef union {
  byte Byte;
  struct {
    byte IREFSTEN    :1;                                       /* Internal Reference Stop Enable */
    byte IRCLKEN     :1;                                       /* Internal Reference Clock Enable */
    byte IREFS       :1;                                       /* Internal Reference Select */
    byte RDIV0       :1;                                       /* Reference Divider, bit 0 */
    byte RDIV1       :1;                                       /* Reference Divider, bit 1 */
    byte RDIV2       :1;                                       /* Reference Divider, bit 2 */
    byte CLKS0       :1;                                       /* Clock Source Select, bit 0 */
    byte CLKS1       :1;                                       /* Clock Source Select, bit 1 */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpRDIV :3;
    byte grpCLKS :2;
  } MergedBits;
} MCGC1STR;
extern volatile MCGC1STR _MCGC1 @0x00000040;
#define MCGC1                           _MCGC1.Byte
#define MCGC1_IREFSTEN                  _MCGC1.Bits.IREFSTEN
#define MCGC1_IRCLKEN                   _MCGC1.Bits.IRCLKEN
#define MCGC1_IREFS                     _MCGC1.Bits.IREFS
#define MCGC1_RDIV0                     _MCGC1.Bits.RDIV0
#define MCGC1_RDIV1                     _MCGC1.Bits.RDIV1
#define MCGC1_RDIV2                     _MCGC1.Bits.RDIV2
#define MCGC1_CLKS0                     _MCGC1.Bits.CLKS0
#define MCGC1_CLKS1                     _MCGC1.Bits.CLKS1
#define MCGC1_RDIV                      _MCGC1.MergedBits.grpRDIV
#define MCGC1_CLKS                      _MCGC1.MergedBits.grpCLKS

#define MCGC1_IREFSTEN_MASK             1U
#define MCGC1_IRCLKEN_MASK              2U
#define MCGC1_IREFS_MASK                4U
#define MCGC1_RDIV0_MASK                8U
#define MCGC1_RDIV1_MASK                16U
#define MCGC1_RDIV2_MASK                32U
#define MCGC1_CLKS0_MASK                64U
#define MCGC1_CLKS1_MASK                128U
#define MCGC1_RDIV_MASK                 56U
#define MCGC1_RDIV_BITNUM               3U
#define MCGC1_CLKS_MASK                 192U
#define MCGC1_CLKS_BITNUM               6U


/*** MCGC2 - MCG Control Register 2; 0x00000041 ***/
typedef union {
  byte Byte;
  struct {
    byte EREFSTEN    :1;                                       /* External Reference Stop Enable */
    byte ERCLKEN     :1;                                       /* External Reference Enable */
    byte EREFS       :1;                                       /* External Reference Select */
    byte LP          :1;                                       /* Low Power Select */
    byte HGO         :1;                                       /* High Gain Oscillator Select */
    byte RANGE       :1;                                       /* Frequency Range Select */
    byte BDIV0       :1;                                       /* Bus Frequency Divider, bit 0 */
    byte BDIV1       :1;                                       /* Bus Frequency Divider, bit 1 */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpBDIV :2;
  } MergedBits;
} MCGC2STR;
extern volatile MCGC2STR _MCGC2 @0x00000041;
#define MCGC2                           _MCGC2.Byte
#define MCGC2_EREFSTEN                  _MCGC2.Bits.EREFSTEN
#define MCGC2_ERCLKEN                   _MCGC2.Bits.ERCLKEN
#define MCGC2_EREFS                     _MCGC2.Bits.EREFS
#define MCGC2_LP                        _MCGC2.Bits.LP
#define MCGC2_HGO                       _MCGC2.Bits.HGO
#define MCGC2_RANGE                     _MCGC2.Bits.RANGE
#define MCGC2_BDIV0                     _MCGC2.Bits.BDIV0
#define MCGC2_BDIV1                     _MCGC2.Bits.BDIV1
#define MCGC2_BDIV                      _MCGC2.MergedBits.grpBDIV

#define MCGC2_EREFSTEN_MASK             1U
#define MCGC2_ERCLKEN_MASK              2U
#define MCGC2_EREFS_MASK                4U
#define MCGC2_LP_MASK                   8U
#define MCGC2_HGO_MASK                  16U
#define MCGC2_RANGE_MASK                32U
#define MCGC2_BDIV0_MASK                64U
#define MCGC2_BDIV1_MASK                128U
#define MCGC2_BDIV_MASK                 192U
#define MCGC2_BDIV_BITNUM               6U


/*** MCGTRM - MCG Trim Register; 0x00000042 ***/
typedef union {
  byte Byte;
  struct {
    byte TRIM0       :1;                                       /* MCG Trim Setting, bit 0 */
    byte TRIM1       :1;                                       /* MCG Trim Setting, bit 1 */
    byte TRIM2       :1;                                       /* MCG Trim Setting, bit 2 */
    byte TRIM3       :1;                                       /* MCG Trim Setting, bit 3 */
    byte TRIM4       :1;                                       /* MCG Trim Setting, bit 4 */
    byte TRIM5       :1;                                       /* MCG Trim Setting, bit 5 */
    byte TRIM6       :1;                                       /* MCG Trim Setting, bit 6 */
    byte TRIM7       :1;                                       /* MCG Trim Setting, bit 7 */
  } Bits;
} MCGTRMSTR;
extern volatile MCGTRMSTR _MCGTRM @0x00000042;
#define MCGTRM                          _MCGTRM.Byte
#define MCGTRM_TRIM0                    _MCGTRM.Bits.TRIM0
#define MCGTRM_TRIM1                    _MCGTRM.Bits.TRIM1
#define MCGTRM_TRIM2                    _MCGTRM.Bits.TRIM2
#define MCGTRM_TRIM3                    _MCGTRM.Bits.TRIM3
#define MCGTRM_TRIM4                    _MCGTRM.Bits.TRIM4
#define MCGTRM_TRIM5                    _MCGTRM.Bits.TRIM5
#define MCGTRM_TRIM6                    _MCGTRM.Bits.TRIM6
#define MCGTRM_TRIM7                    _MCGTRM.Bits.TRIM7

#define MCGTRM_TRIM0_MASK               1U
#define MCGTRM_TRIM1_MASK               2U
#define MCGTRM_TRIM2_MASK               4U
#define MCGTRM_TRIM3_MASK               8U
#define MCGTRM_TRIM4_MASK               16U
#define MCGTRM_TRIM5_MASK               32U
#define MCGTRM_TRIM6_MASK               64U
#define MCGTRM_TRIM7_MASK               128U


/*** MCGSC - MCG Status and Control Register; 0x00000043 ***/
typedef union {
  byte Byte;
  struct {
    byte FTRIM_bit   :1;                                       /* MCG Fine Trim */ /*Warning: bit name is duplicated with register name*/
    byte OSCINIT     :1;                                       /* OSC Initialization */
    byte CLKST0      :1;                                       /* Clock Mode Status, bit 0 */
    byte CLKST1      :1;                                       /* Clock Mode Status, bit 1 */
    byte IREFST      :1;                                       /* Internal Reference Status */
    byte PLLST       :1;                                       /* PLL Select Status */
    byte LOCK        :1;                                       /* Lock Status */
    byte LOLS        :1;                                       /* Loss of Lock Status */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpCLKST :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} MCGSCSTR;
